org-files/windows-find-used-port-and-kill-process.org
#+SETUPFILE: setup/css/theme-0.orgcss
#+TITLE: 在Windows cmd里查找占用端口的进程并杀掉

在写网络程序的时候，调试时，有的进程占用端口不放弃，会导致后续的调试没法继续。那么windows下快捷处理呢？

在cmd窗口里使用netstat、findstr、taskkill就行，类似linux下的netstat、grep、kill。

首先是运行cmd窗口（window键盘+r，输入cmd，回车，出来黑色窗口），然后执行如下操作：

#+BEGIN_SRC shell
netstat -ano |findstr ":10000"
#+END_SRC

在Windows 10上，输出类似，其中最后一列是pid（进程号）：

#+BEGIN_SRC shell
TCP    0.0.0.0:22             0.0.0.0:0              LISTENING       5136
#+END_SRC

然后，在cmd窗口里用taskkill杀掉这个进程：

#+BEGIN_SRC shell
taskkill /pid 5136
#+END_SRC
