windows-find-used-port-and-kill-process.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2017-10-28 Sat 09:22 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>在Windows cmd里查找占用端口的进程并杀掉</title>
<meta name="generator" content="Org mode">
<meta name="author" content="md11235">
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">在Windows cmd里查找占用端口的进程并杀掉</h1>
<p>
在写网络程序的时候，调试时，有的进程占用端口不放弃，会导致后续的调试没法继续。那么windows下快捷处理呢？</p>

<p>
在cmd窗口里使用netstat、findstr、taskkill就行，类似linux下的netstat、grep、kill。</p>

<p>
首先是运行cmd窗口（window键盘+r，输入cmd，回车，出来黑色窗口），然后执行如下操作：</p>

<div class="org-src-container">
<pre class="src src-shell">netstat -ano |findstr <span style="color: #ffa500;">":10000"</span>
</pre>
</div>

<p>
在Windows 10上，输出类似，其中最后一列是pid（进程号）：</p>

<div class="org-src-container">
<pre class="src src-shell">TCP    0.0.0.0:22             0.0.0.0:0              LISTENING       5136
</pre>
</div>

<p>
然后，在cmd窗口里用taskkill杀掉这个进程：</p>

<div class="org-src-container">
<pre class="src src-shell">taskkill /pid 5136
</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: md11235 (<a href="mailto:md11235@gmail.com">md11235@gmail.com</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.0.50 (<a href="http://orgmode.org">Org</a> mode 9.1.2)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>